artillery.yml
config:
  target: "http://localhost:5173"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up (Spike Simulation Start)"
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load (500 users proxy)"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load (Soak test proxy)"
  plugins:
    metrics-by-endpoint: {}
scenarios:
  - name: "Customer flow"
    flow:
      - get:
          url: "/"
      - think: 2
      - get:
          url: "/customer/dashboard"
      - think: 5
      - get:
          url: "/customer/orders"
  - name: "Admin Dashboard Refresh"
    flow:
      - get:
          url: "/admin"
      - think: 1
      - get:
          url: "/admin/orders"